tap "homebrew/bundle"
brew "glib"
brew "cask"
brew "docker"
brew "ffmpeg"
brew "firebase-cli"
brew "gcc"
brew "git"
brew "go"
brew "harfbuzz"
brew "htop"
brew "libass"
brew "n"
brew "pango"
brew "pyenv"
brew "python@3.12"
brew "tesseract"
brew "tree"
brew "yt-dlp"
cask "altserver"
cask "discord"
cask "flutter"
cask "gimp"
cask "google-chrome"
cask "hyper"
cask "notion"
cask "proton-pass"
cask "rectangle"
cask "spotify"
cask "visual-studio-code"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vsliveshare.vsliveshare"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "yaozheng.vscode-pde"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
