tap "homebrew/bundle"
brew "gcc"
brew "git"
brew "go"
brew "htop"
brew "openjdk"
brew "maven"
brew "n"
brew "openjdk@17"
brew "tree"
cask "background-music"
cask "discord"
cask "google-chrome"
cask "hyper"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "rectangle"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "vivaldi"
vscode "dbaeumer.vscode-eslint"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-vsliveshare.vsliveshare"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "yaozheng.vscode-pde"
