tap "homebrew/bundle"
brew "python@3.12"
brew "glib"
brew "cask"
brew "docker"
brew "harfbuzz"
brew "libass"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "gcc"
brew "git"
brew "go"
brew "htop"
brew "maven"
brew "n"
brew "openjdk@17"
brew "pyenv"
brew "tree"
brew "yt-dlp"
cask "arc"
cask "discord"
cask "gimp"
cask "google-chrome"
cask "hyper"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "notion"
cask "rectangle"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "vivaldi"
vscode "dbaeumer.vscode-eslint"
vscode "golang.go"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vsliveshare.vsliveshare"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "taizod1024.ac-ts-extension"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "yaozheng.vscode-pde"
